#Read the data file: Balance.csv

In [2]:
import pandas as pd
file_path = 'balance.csv'
df = pd.read_csv(file_path)
print(df.head())

   Customer_ID Customer_Name Gender  Balance  Deposite
0            1            Ah      F      500        80
1            2            Ab      F      340        82
2            3            Ah      F     3000        81
3            4            Ab      M      200       120
4            5            Ah      M      120       300

#Create a new column by the name of (Total Balance) which is the sum of the deposit and the balance

In [5]:
df['Total balance'] = df['Balance'] + df['Deposite']
df.head()

   Customer_ID Customer_Name Gender  Balance  Deposite  Total balance
0            1            Ah      F      500        80            580
1            2            Ab      F      340        82            422
2            3            Ah      F     3000        81           3081
3            4            Ab      M      200       120            320
4            5            Ah      M      120       300            420

#Add 3 per cent to the Balance Column

In [8]:
df['Balance'] = df['Balance'] * 1.03
df['Balance'].head()

0     546.36350
1     371.52718
2    3278.18100
3     218.54540
4     131.12724
Name: Balance, dtype: float64

#Remove the Custumer_Name columnvv

In [9]:
df = df.drop('Customer_Name', axis=1)
df.head()

   Customer_ID Gender     Balance  Deposite  Total balance
0            1      F   546.36350        80            580
1            2      F   371.52718        82            422
2            3      F  3278.18100        81           3081
3            4      M   218.54540       120            320
4            5      M   131.12724       300            420

#Rename the Customer_ID to become ID

In [10]:
df = df.rename(columns={'Customer_ID': 'ID'})
df.head()

   ID Gender     Balance  Deposite  Total balance
0   1      F   546.36350        80            580
1   2      F   371.52718        82            422
2   3      F  3278.18100        81           3081
3   4      M   218.54540       120            320
4   5      M   131.12724       300            420